app/services/burnout_calculator_service.rb

SELECT "focus_stats".* FROM "focus_stats" WHERE "focus_stats"."user_id" = 2 AND "focus_stats"."date" = '2026-01-07' LIMIT 1
---
  def self.calculate(user)
    # Simple rule-based calculation for now
    # Can be enhanced with more data
    today_stats = FocusStat.find_by(user: user, date: Date.today)