app/controllers/dashboard_controller.rb

  def index
    @stats = FocusStat.where(user: current_user)

    @weekly_study_minutes = @stats.group_by_day(:date, range: 1.week.ago..Date.today).sum(:total_study_minutes)

    @today_stat = @stats.find_by(date: Date.today)
    @burnout_score = @today_stat&.burnout_score || "Low"

    @recent_sessions = current_user.study_sessions.order(created_at: :desc).limit(5)

    @active_session = current_user.study_sessions.where(end_time: nil).last
---
SELECT "focus_stats".* FROM "focus_stats" WHERE "focus_stats"."user_id" = 2 AND "focus_stats"."date" = '2026-01-07' LIMIT 1
SELECT SUM("focus_stats"."total_study_minutes") AS "sum_total_study_minutes", groupdate_internal('day', "focus_stats"."date", 'Etc/UTC', 0, NULL) AS "groupdate_internal_day_focus_stats_date_etc_utc_0_null" FROM "focus_stats" WHERE "focus_stats"."user_id" = 2 AND ("focus_stats"."date" >= '2025-12-31 08:45:00.098669' AND "focus_stats"."date" < '2026-01-08 00:00:00') GROUP BY groupdate_internal('day', "focus_stats"."date", 'Etc/UTC', 0, NULL)
SELECT "study_sessions".* FROM "study_sessions" WHERE "study_sessions"."user_id" = 2 AND "study_sessions"."end_time" IS NULL ORDER BY "study_sessions"."id" DESC LIMIT 1