app/controllers/study_sessions_controller.rb

SELECT "study_sessions".* FROM "study_sessions" WHERE "study_sessions"."user_id" = 2 ORDER BY "study_sessions"."created_at" DESC
SELECT "study_sessions".* FROM "study_sessions" WHERE "study_sessions"."user_id" = 2 AND "study_sessions"."end_time" IS NULL ORDER BY "study_sessions"."id" DESC LIMIT 1
---
  def index
    @study_sessions = current_user.study_sessions.order(created_at: :desc)
    @active_session = current_user.study_sessions.where(end_time: nil).last

INSERT INTO "study_sessions" ("user_id", "subject", "start_time", "end_time", "duration", "created_at", "updated_at") VALUES (2, 'maths', '2026-01-07 08:48:12.100291', NULL, NULL, '2026-01-07 08:48:12.101196', '2026-01-07 08:48:12.101196') RETURNING "id"
---
  def create
    @study_session = current_user.study_sessions.new(study_session_params)
    @study_session.start_time = Time.current

    if @study_session.save

UPDATE "study_sessions" SET "end_time" = '2026-01-07 08:48:19.155451', "updated_at" = '2026-01-07 08:48:19.157328' WHERE "study_sessions"."id" = 4
UPDATE "study_sessions" SET "duration" = 1, "updated_at" = '2026-01-07 09:41:32.524755' WHERE "study_sessions"."id" = 17
INSERT INTO "focus_stats" ("user_id", "date", "total_study_minutes", "burnout_score", "created_at", "updated_at") VALUES (2, '2026-01-07', NULL, NULL, '2026-01-07 10:10:50.753615', '2026-01-07 10:10:50.753615') RETURNING "id"
SELECT "focus_stats".* FROM "focus_stats" WHERE "focus_stats"."user_id" = 2 AND "focus_stats"."date" = '2026-01-07' LIMIT 1
UPDATE "focus_stats" SET "total_study_minutes" = COALESCE("focus_stats"."total_study_minutes", 0) + 1 WHERE "focus_stats"."id" = 4
UPDATE "focus_stats" SET "burnout_score" = 'High', "updated_at" = '2026-01-07 09:41:32.554451' WHERE "focus_stats"."id" = 4
---
  def finish
    @study_session.update(end_time: Time.current)
    # Round up duration
    duration = ((@study_session.end_time - @study_session.start_time) / 60).ceil
    @study_session.update(duration: duration)

    # Update daily stats
    stat = FocusStat.find_or_create_by(user: current_user, date: Date.today)
    stat.total_study_minutes ||= 0 # Ensure not nil
    stat.increment!(:total_study_minutes, duration)

    # Calculate Burnout Score
    score = BurnoutCalculatorService.calculate(current_user)
    stat.update(burnout_score: score)

SELECT "study_sessions".* FROM "study_sessions" WHERE "study_sessions"."user_id" = 2 AND "study_sessions"."id" = 17 LIMIT 1
---
  def set_study_session
    @study_session = current_user.study_sessions.find(params[:id])